cedriclako/C-1421-carte-controle/ESP32-Remote-Prototype/sbi-iot-server/main/webserver/webserver.c
#include "esp_log.h"
#include "esp_vfs.h"
#include <stdio.h>
#include <sys/param.h>
#include <sys/unistd.h>
#include <sys/stat.h>
#include <dirent.h>
#include <inttypes.h>
#include "esp_app_format.h"
#include "assets/EmbeddedFiles.h"
#include "esp_ota_ops.h"
#include "esp_mac.h"
#include "esp_chip_info.h"
#include "cJSON.h"
#include "freertos/FreeRTOS.h"
#include "stm32-process.h"
#include "stm32-protocol.h"
#include "event.h"
#include "webserver.h"
#include "hardwaregpio.h"
#include "../espnowprocess.h"
#include "nvsjson.h"
#include "../settings.h"
#include "../main.h"
#include "../fwconfig.h"
#include "apiurl.h"
#include "../uartbridge/stovemb.h"
#include "../uartbridge/uartbridge.h"

#define TAG "webserver"

/* Max length a file path can have on storage */
#define HTTPSERVER_BUFFERSIZE (1024*10)

static esp_err_t api_get_handler(httpd_req_t *req);
static esp_err_t api_post_handler(httpd_req_t *req);

static esp_err_t file_get_handler(httpd_req_t *req);
static esp_err_t file_post_handler(httpd_req_t *req);
static esp_err_t set_content_type_from_file(httpd_req_t *req, const char *filename);

static esp_err_t file_postotauploadESP32_handler(httpd_req_t *req);
static esp_err_t file_postotauploadSTM32_handler(httpd_req_t *req);

static const EF_SFile* GetFile(const char* strFilename);

static char* GetSysInfo();
static char* GetLiveData();
static void ToHexString(char *dstHexString, const uint8_t* data, uint8_t len);
static const char* GetESPChipId(esp_chip_model_t eChipid);

static uint8_t m_u8Buffers[HTTPSERVER_BUFFERSIZE];

/*! @brief this variable is set by linker script, don't rename it. It contains app image informations. */
extern const esp_app_desc_t esp_app_desc;

static bool m_bIsPairing = false;

static const httpd_uri_t m_sHttpUI = {
    .uri       = "/*",
    .method    = HTTP_GET,
    .handler   = file_get_handler,
    /* Let's pass response string in user
     * context to demonstrate it's usage */
    .user_ctx  = ""
};

static const httpd_uri_t m_sHttpGetAPI = {
    .uri       = "/api/*",
    .method    = HTTP_GET,
    .handler   = api_get_handler,
    /* Let's pass response string in user
     * context to demonstrate it's usage */
    .user_ctx  = ""
};

static const httpd_uri_t m_sHttpPostAPI = {
    .uri       = "/api/*",
    .method    = HTTP_POST,
    .handler   = api_post_handler,
    /* Let's pass response string in user
     * context to demonstrate it's usage */
    .user_ctx  = ""
};
static const httpd_uri_t m_sHttpActionPost = {
    .uri       = "/action/*",
    .method    = HTTP_POST,
    .handler   = file_post_handler,
    /* Let's pass response string in user
     * context to demonstrate it's usage */
    .user_ctx  = ""
};

static const httpd_uri_t m_sHttpOTAUploadESP32Post = {
    .uri       = "/ota/upload_esp32",
    .method    = HTTP_POST,
    .handler   = file_postotauploadESP32_handler,
    /* Let's pass response string in user
     * context to demonstrate it's usage */
    .user_ctx  = ""
};

static const httpd_uri_t m_sHttpOTAUploadSTM32Post = {
    .uri       = "/ota/upload_stm32",
    .method    = HTTP_POST,
    .handler   = file_postotauploadSTM32_handler,
    /* Let's pass response string in user
     * context to demonstrate it's usage */
    .user_ctx  = ""
};

void WEBSERVER_Init()
{
    httpd_handle_t server = NULL;
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.task_priority = FWCONFIG_HTTPTASK_PRIORITY;
    config.stack_size = 9500;
    config.lru_purge_enable = true;
    config.uri_match_fn = httpd_uri_match_wildcard;
    config.max_open_sockets = 13;

    // Start the httpd server
    ESP_LOGI(TAG, "Starting server on port: '%d'", config.server_port);
    if (httpd_start(&server, &config) == ESP_OK) {
        // Set URI handlers
        ESP_LOGI(TAG, "Registering URI handlers");
        httpd_register_uri_handler(server, &m_sHttpActionPost);
        httpd_register_uri_handler(server, &m_sHttpGetAPI);
        httpd_register_uri_handler(server, &m_sHttpPostAPI);
        httpd_register_uri_handler(server, &m_sHttpUI);
        // return server;
        httpd_register_uri_handler(server, &m_sHttpOTAUploadESP32Post);
        httpd_register_uri_handler(server, &m_sHttpOTAUploadSTM32Post);
    }
}

/* An HTTP GET handler */
static esp_err_t file_get_handler(httpd_req_t *req)
{
    const EF_SFile* pFile = NULL;

    ESP_LOGI(TAG, "Opening file uri: %s", req->uri);

    // Redirect root to index.html
    if (strcmp(req->uri, "/") == 0)
    {
        pFile = GetFile(DEFAULT_RELATIVE_URI+1);
    }
    else {
        pFile = GetFile(req->uri+1);
    }

    if (pFile == NULL)
    {
        httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "File does not exist");
        return ESP_FAIL;
    }

    set_content_type_from_file(req, pFile->strFilename);

    uint32_t u32Index = 0;

    while(u32Index < pFile->u32Length)
    {
        const uint32_t n = MIN(pFile->u32Length - u32Index, HTTPSERVER_BUFFERSIZE);

        if (n > 0) {
            /* Send the buffer contents as HTTP response m_u8Buffers */
            if (httpd_resp_send_chunk(req, (char*)(pFile->pu8StartAddr + u32Index), n) != ESP_OK) {
                ESP_LOGE(TAG, "File sending failed!");
                /* Abort sending file */
                httpd_resp_sendstr_chunk(req, NULL);
                /* Respond with 500 Internal Server Error */
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to send file");
                return ESP_FAIL;
           }
        }
        u32Index += n;
    }

    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
}

static esp_err_t file_post_handler(httpd_req_t *req)
{
    ESP_LOGI(TAG, "file_post_handler, url: %s", req->uri);

    if (strcmp(req->uri, ACTION_POST_REBOOT) == 0)
    {
        esp_restart();
    }
    else if (strcmp(req->uri, ACTION_POST_DOWNLOADCONFIG) == 0)
    {
        esp_event_post_to(EVENT_g_LoopHandle, MAINAPP_EVENT, REQUESTCONFIGRELOAD_EVENT, NULL, 0, 0);
    }
    else if (strcmp(req->uri, ACTION_POST_ESPNOW_STARTPAIRING) == 0)
    {
        m_bIsPairing = true;
        ESP_LOGI(TAG, "Starting pairing");
    }
    else if (strcmp(req->uri, ACTION_POST_ESPNOW_STOPPAIRING) == 0)
    {
        m_bIsPairing = false;
        ESP_LOGI(TAG, "Stopping pairing");
    }
    else
    {
        ESP_LOGE(TAG, "Unknown request for url: %s", req->uri);
        goto ERROR;
    }
 
    ESP_LOGI(TAG, "file_post_handler, url: %s | #3", req->uri);
    httpd_resp_set_hdr(req, "Connection", "close");
    ESP_LOGI(TAG, "file_post_handler, url: %s | #4", req->uri);
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
    ERROR:
    ESP_LOGE(TAG, "Invalid request");
    httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Bad request");
    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_FAIL;
}

static esp_err_t api_get_handler(httpd_req_t *req)
{
    esp_err_t esperr = ESP_OK;

    //ESP_LOGI(TAG, "api_get_handler, url: %s", req->uri);
    char szError[128+1] = {0,};
    char* pExportJSON = NULL;
    
    httpd_resp_set_type(req, "application/json");
    
    if (strcmp(req->uri, API_GETSETTINGSJSON_URI) == 0)
    {
        pExportJSON = NVSJSON_ExportJSON(&g_sSettingHandle);

        if (pExportJSON == NULL || httpd_resp_send_chunk(req, pExportJSON, strlen(pExportJSON)) != ESP_OK)
            goto ERROR;
    }
    else if (strcmp(req->uri, API_GETSYSINFOJSON_URI) == 0)
    {
        pExportJSON = GetSysInfo();
        if (pExportJSON == NULL || httpd_resp_send_chunk(req, pExportJSON, strlen(pExportJSON)) != ESP_OK)
            goto ERROR;
    }
    else if (strcmp(req->uri, API_GETLIVEDATAJSON_URI) == 0)
    {
        pExportJSON = GetLiveData();
        if (pExportJSON == NULL || httpd_resp_send_chunk(req, pExportJSON, strlen(pExportJSON)) != ESP_OK)
            goto ERROR;
    }
    else if (strcmp(req->uri, API_GETSERVERPARAMETERFILEJSON_URI) == 0)
    {
        pExportJSON = STOVEMB_ExportParamToJSON();
        if (pExportJSON == NULL || httpd_resp_send_chunk(req, pExportJSON, strlen(pExportJSON)) != ESP_OK)
        {
            strcpy(szError, "Server parameter file is not available");
            goto ERROR;
        }
    }
    else
    {
        ESP_LOGE(TAG, "api_get_handler, url: %s", req->uri);
        httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "Unknown request");
        goto END;
    }

    goto END;
    ERROR:
    esperr = ESP_FAIL;
    if (strlen(szError) > 0)
    {
        ESP_LOGE(TAG, "api_post_handler, url: %s, error: %s", req->uri, szError);
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, szError);
    }
    else
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "unknown error");
    END:
    if (pExportJSON != NULL)
        free(pExportJSON);
    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_send_chunk(req, NULL, 0);
    return esperr;
}

static esp_err_t api_post_handler(httpd_req_t *req)
{
    esp_err_t esperr = ESP_OK;
    char szError[128+1] = {0,};

    const int total_len = req->content_len;

    if (total_len >= HTTPSERVER_BUFFERSIZE-1)
    {
        /* Respond with 500 Internal Server Error */
        ESP_LOGE(TAG, "content too long");
        goto ERROR;
    }

    // Receive the complete payload.
    int n = 0;
    while (n < total_len)
    {
        const int received = httpd_req_recv(req, (char*)(m_u8Buffers + n), total_len);
        if (received <= 0) {
            /* Respond with 500 Internal Server Error */
            ESP_LOGE(TAG, "Failed to post control value");
            goto ERROR;
        }
        n += received;
    }
    m_u8Buffers[n] = '\0';

    ESP_LOGI(TAG, "api_post_handler, url: %s", req->uri);
    if (strcmp(req->uri, API_POSTSETTINGSJSON_URI) == 0)
    {
        if (!NVSJSON_ImportJSON(&g_sSettingHandle, (const char*)m_u8Buffers))
        {
            snprintf(szError, sizeof(szError), "%s", "Unable to import JSON");
            goto ERROR;
        }
    }
    else if (strcmp(req->uri, API_POSTSERVERPARAMETERFILEJSON_URI) == 0)
    {
        ESP_LOGI(TAG, "api_post_handler, url: %s, json len: %d", req->uri, n);

