cedriclako/C-1421-carte-controle/ESP32-Remote-Prototype/sbi-iot-server/main/webserver/webserver.c
    char* pStr =  cJSON_PrintUnformatted(pRoot);
    cJSON_Delete(pRoot);
    return pStr;
    ERROR:
    cJSON_Delete(pRoot);
    return NULL;
}

static char* GetLiveData()
{
    cJSON* pRoot = NULL;

    pRoot = cJSON_CreateObject();
    if (pRoot == NULL)
        goto ERROR;
        
    cJSON* pState = cJSON_CreateObject();
    cJSON_AddItemToObject(pState, "is_pairing", cJSON_CreateBool(m_bIsPairing));
    cJSON_AddItemToObject(pRoot, "state", pState);

    cJSON* pWireless = cJSON_CreateObject();
    ESPNOWPROCESS_ESPNowInfo sESPNowInfo = ESPNOWPROCESS_GetESPNowInfo();
    cJSON_AddItemToObject(pWireless, "rx", cJSON_CreateNumber(sESPNowInfo.u32RX));
    cJSON_AddItemToObject(pWireless, "tx", cJSON_CreateNumber(sESPNowInfo.u32TX)); 

    wifi_second_chan_t secondChan;
    uint8_t u8Primary;
    esp_wifi_get_channel(&u8Primary,  &secondChan);
    cJSON_AddItemToObject(pWireless, "channel", cJSON_CreateNumber(u8Primary)); 

    cJSON_AddItemToObject(pRoot, "wireless", pWireless);

    STOVEMB_Take(portMAX_DELAY);
    // Stove
    cJSON* pStove = cJSON_CreateObject();
    const STOVEMB_SMemBlock* pMemBlock = STOVEMB_GetMemBlockRO();
    cJSON_AddItemToObject(pStove, "is_connected", cJSON_CreateBool(pMemBlock->bIsStoveConnectedAndReady));
    cJSON_AddItemToObject(pStove, "param_cnt", cJSON_CreateNumber(pMemBlock->u32ParameterCount));
    cJSON_AddItemToObject(pStove, "is_param_upload_error", cJSON_CreateBool(pMemBlock->bIsAnyUploadError));
    cJSON_AddItemToObject(pStove, "is_param_download_error", cJSON_CreateBool(pMemBlock->bIsAnyDownloadError));
    cJSON_AddItemToObject(pRoot, "stove", pStove);
    // Remote
    cJSON* pRemote = cJSON_CreateObject();
    cJSON_AddItemToObject(pRemote, "tempC_current", cJSON_CreateNumber(pMemBlock->sRemoteData.fTempCurrentC));
    cJSON_AddItemToObject(pRemote, "tempC_sp", cJSON_CreateNumber(pMemBlock->sRemoteData.sTempSetpoint.temp));
    cJSON_AddItemToObject(pRemote, "fanspeed", cJSON_CreateNumber((int)pMemBlock->sRemoteData.eFanSpeedCurr));
    const TickType_t ttLastCommTicks = xTaskGetTickCount() - pMemBlock->sRemoteData.ttLastCommunicationTicks;
    cJSON_AddItemToObject(pRemote, "lastcomm_ms", cJSON_CreateNumber(pdTICKS_TO_MS(ttLastCommTicks)));

    cJSON_AddItemToObject(pRoot, "remote", pRemote);

    // Date time
    time_t now = 0;
    struct tm timeinfo = { 0 };
    time(&now);
    localtime_r(&now, &timeinfo);
    
    char text[80+1];
    sprintf(text, "%4d-%2d-%2d %2d:%2d:%2d",
        /* 0*/1900+timeinfo.tm_year,
        /* 1*/timeinfo.tm_mon+1,
        /* 2*/timeinfo.tm_mday,
        /* 3*/timeinfo.tm_hour,
        /* 4*/timeinfo.tm_min,
        /* 5*/timeinfo.tm_sec);
    cJSON_AddItemToObject(pRoot, "datetime", cJSON_CreateString(text));

    STOVEMB_Give();

    char* pStr =  cJSON_PrintUnformatted(pRoot);
    cJSON_Delete(pRoot);
    return pStr;
    ERROR:
    cJSON_Delete(pRoot);
    return NULL;
}

static void ToHexString(char *dstHexString, const uint8_t* data, uint8_t len)
{
    for (uint32_t i = 0; i < len; i++)
        sprintf(dstHexString + (i * 2), "%02X", data[i]);
}

static const char* GetESPChipId(esp_chip_model_t eChipid)
{
    switch(eChipid)
    {
        case CHIP_ESP32:
            return "ESP32";
        case CHIP_ESP32S2:
            return "ESP32-S2";
        case CHIP_ESP32C2:
            return "ESP32-C2";
        case CHIP_ESP32C3:
            return "ESP32-C3";
        case CHIP_ESP32S3:
            return "ESP32-S3";
        case CHIP_ESP32H2:
            return "ESP32-H2";
    }
    return "";
}

static esp_err_t file_postotauploadESP32_handler(httpd_req_t *req)
{
    ESP_LOGI(TAG, "file_postotauploadESP32_handler / uri: %s", req->uri);

    const esp_partition_t *configured = esp_ota_get_boot_partition();
    const esp_partition_t *running = esp_ota_get_running_partition();

    if (configured != running)
    {
        ESP_LOGW(TAG, "Configured OTA boot partition at offset 0x%08"PRIx32", but running from offset 0x%08"PRIx32,
            (int32_t)configured->address, (int32_t)running->address);
        ESP_LOGW(TAG, "(This can happen if either the OTA boot data or preferred boot image become corrupted somehow.)");
    }

    ESP_LOGI(TAG, "Running partition type %"PRId32" subtype %"PRId32" (offset 0x%08"PRIx32")",
        (int32_t)running->type, (int32_t)running->subtype, (int32_t)running->address);

    const esp_partition_t* update_partition = esp_ota_get_next_update_partition(NULL);
    assert(update_partition != NULL);
    ESP_LOGI(TAG, "Writing to partition subtype %"PRId32" at offset 0x%"PRIx32,
        (int32_t)update_partition->subtype, (int32_t)update_partition->address);

    esp_ota_handle_t update_handle = 0;

    esp_err_t err = esp_ota_begin(update_partition, OTA_WITH_SEQUENTIAL_WRITES, &update_handle);
    err = esp_ota_begin(update_partition, OTA_WITH_SEQUENTIAL_WRITES, &update_handle);
    if (err != ESP_OK)
    {
        ESP_LOGE(TAG, "esp_ota_begin failed (%s)", esp_err_to_name(err));
        esp_ota_abort(update_handle);
        goto ERROR;
    }

    int n = httpd_req_recv(req, (char*)m_u8Buffers, HTTPSERVER_BUFFERSIZE);
    int binary_file_length = 0;

    while(n > 0)
    {
        ESP_LOGI(TAG, "file_postotauploadESP32_handler / receiving: %d bytes", n);

        err = esp_ota_write( update_handle, (const void *)m_u8Buffers, n);
        if (err != ESP_OK)
        {
            esp_ota_abort(update_handle);
            goto ERROR;
        }
        binary_file_length += n;
        ESP_LOGD(TAG, "Written image length %d", binary_file_length);

        n = httpd_req_recv(req, (char*)m_u8Buffers, HTTPSERVER_BUFFERSIZE);
    }

    err = esp_ota_end(update_handle);
    if (err != ESP_OK)
    {
        if (err == ESP_ERR_OTA_VALIDATE_FAILED) {
            ESP_LOGE(TAG, "Image validation failed, image is corrupted");
        } else {
            ESP_LOGE(TAG, "esp_ota_end failed (%s)!", esp_err_to_name(err));
        }

        // TODO: esp_ota_abort(update_handle); needed ?
        goto ERROR;
    }

