cedriclako/C-1421-carte-controle/ESP32-Remote-Prototype/sbi-iot-server/main/webserver/webserver.c
    err = esp_ota_set_boot_partition(update_partition);
    if (err != ESP_OK)
    {
        ESP_LOGE(TAG, "esp_ota_set_boot_partition failed (%s)!", esp_err_to_name(err));
        goto ERROR;
    }

    ESP_LOGI(TAG, "OTA Completed !");
    ESP_LOGI(TAG, "Prepare to restart system!");

    esp_restart();

    httpd_resp_set_hdr(req, "Connection", "close");
    return ESP_OK;
    ERROR:
    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid image");
    return ESP_FAIL;
}


static esp_err_t file_postotauploadSTM32_handler(httpd_req_t *req)
{
    esp_err_t err = ESP_FAIL;
    const char* szError = NULL;

    FILE* flash_file = NULL;

    httpd_resp_set_type(req, "application/json");
    const char* filename = FWCONFIG_SPIFF_ROOTPATH"/stm32.bin";

    ESP_LOGI(TAG, "file_postotauploadSTM32_handler / uri: %s, filename: %s", req->uri, filename);

    // Stop the UART bridge
    UARTBRIDGE_SetSilenceMode(true);

    // Prepare the STM32
    flash_file = fopen(filename, "w");
    if (flash_file == NULL)
    {
        szError = "Unable to open file for writing operation";
        goto ERROR;
    }

    int binary_file_length = 0;
    int n = 0;
    
    do
    {
        n = httpd_req_recv(req, (char*)m_u8Buffers, HTTPSERVER_BUFFERSIZE);
        if (n == 0) {
            break;
        }
        else if (n < 0) {
            /* Respond with 500 Internal Server Error */
            szError = "Failed to receive";
            goto ERROR;
        }
        fwrite (m_u8Buffers , sizeof(uint8_t), n, flash_file);
        ESP_LOGI(TAG, "file_postotauploadSTM32_handler / receiving: %d bytes", n);

        binary_file_length += n;
    }
    while (n > 0);

    // Initialize upload
    STM32PROTOCOL_SContext sContext;
    STM32PROTOCOL_SConfig sConfig = STM32PROTOCOL_SCONFIG_INIT;
    sConfig.bInitGPIO = true;
    sConfig.reset_pin = HWGPIO_STM32_RESET_PIN;
    sConfig.boot0_pin = HWGPIO_STM32_BOOT0_PIN;

    sConfig.uart_port = HWGPIO_BRIDGEUART_PORT_NUM;

    STM32PROTOCOL_Init(&sContext, &sConfig);

    if (STM32PROCESS_FlashSTM(&sContext, filename) != ESP_OK)
    {
        szError = "Unable to flash";
        goto ERROR;
    }

    err = ESP_OK;
    goto END;
    ERROR:
    err = ESP_FAIL;
    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, ((szError != NULL) ? szError : "Unknown error"));
    END:
    if (flash_file != NULL)
        fclose(flash_file);

    httpd_resp_set_hdr(req, "Connection", "close");
    // Restore the UART bridge.
    UARTBRIDGE_SetSilenceMode(false);
    return err;
}